tap "railwaycat/emacsmacport"

brew "aspell"
brew "cmake"
brew "libtool"
brew "bat"
brew "eza"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "ghq"
brew "ripgrep"
brew "starship"
brew "mise"
brew "webp"
brew "railwaycat/emacsmacport/emacs-mac@29", args: ["with-modern-icon"]

cask "font-hack-nerd-font"
cask "claude-code"
cask "ghostty"
cask "keepassxc"
cask "obsidian"
cask "raycast"
